# YCoordinate

## Description
Returns the Y coordinate of the object relative to the user origin.

```pascal
FUNCTION YCoordinate(c : CRITERIA) : REAL;
```

```python

def vs.YCoordinate(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|The search criteria string.|

## Version
Availability: from Vectorworks 2011
## Category
* Criteria